renesas/fsp/ra/fsp/src/bsp/mcu/ra6t2/bsp_override_reg.h
                struct
                {
                    __IM uint16_t PIDR0  : 1; /*!< [0..0] Pmn Input Data                                                     */
                    __IM uint16_t PIDR1  : 1; /*!< [1..1] Pmn Input Data                                                     */
                    __IM uint16_t PIDR2  : 1; /*!< [2..2] Pmn Input Data                                                     */
                    __IM uint16_t PIDR3  : 1; /*!< [3..3] Pmn Input Data                                                     */
                    __IM uint16_t PIDR4  : 1; /*!< [4..4] Pmn Input Data                                                     */
                    __IM uint16_t PIDR5  : 1; /*!< [5..5] Pmn Input Data                                                     */
                    __IM uint16_t PIDR6  : 1; /*!< [6..6] Pmn Input Data                                                     */
                    __IM uint16_t PIDR7  : 1; /*!< [7..7] Pmn Input Data                                                     */
                    __IM uint16_t PIDR8  : 1; /*!< [8..8] Pmn Input Data                                                     */
                    __IM uint16_t PIDR9  : 1; /*!< [9..9] Pmn Input Data                                                     */
                    __IM uint16_t PIDR10 : 1; /*!< [10..10] Pmn Input Data                                                   */
                    __IM uint16_t PIDR11 : 1; /*!< [11..11] Pmn Input Data                                                   */
                    __IM uint16_t PIDR12 : 1; /*!< [12..12] Pmn Input Data                                                   */
                    __IM uint16_t PIDR13 : 1; /*!< [13..13] Pmn Input Data                                                   */
                    __IM uint16_t PIDR14 : 1; /*!< [14..14] Pmn Input Data                                                   */
                    __IM uint16_t PIDR15 : 1; /*!< [15..15] Pmn Input Data                                                   */
                } PIDR_b;
            };

            union
            {
                __IM uint16_t EIDR;           /*!< (@ 0x00000006) Event input data register                                  */

                struct
                {
                    __IM uint16_t EIDR0  : 1; /*!< [0..0] Pmn Event Input Data                                               */
                    __IM uint16_t EIDR1  : 1; /*!< [1..1] Pmn Event Input Data                                               */
                    __IM uint16_t EIDR2  : 1; /*!< [2..2] Pmn Event Input Data                                               */
                    __IM uint16_t EIDR3  : 1; /*!< [3..3] Pmn Event Input Data                                               */
                    __IM uint16_t EIDR4  : 1; /*!< [4..4] Pmn Event Input Data                                               */
                    __IM uint16_t EIDR5  : 1; /*!< [5..5] Pmn Event Input Data                                               */
                    __IM uint16_t EIDR6  : 1; /*!< [6..6] Pmn Event Input Data                                               */
                    __IM uint16_t EIDR7  : 1; /*!< [7..7] Pmn Event Input Data                                               */
                    __IM uint16_t EIDR8  : 1; /*!< [8..8] Pmn Event Input Data                                               */
                    __IM uint16_t EIDR9  : 1; /*!< [9..9] Pmn Event Input Data                                               */
                    __IM uint16_t EIDR10 : 1; /*!< [10..10] Pmn Event Input Data                                             */
                    __IM uint16_t EIDR11 : 1; /*!< [11..11] Pmn Event Input Data                                             */
                    __IM uint16_t EIDR12 : 1; /*!< [12..12] Pmn Event Input Data                                             */
                    __IM uint16_t EIDR13 : 1; /*!< [13..13] Pmn Event Input Data                                             */
                    __IM uint16_t EIDR14 : 1; /*!< [14..14] Pmn Event Input Data                                             */
                    __IM uint16_t EIDR15 : 1; /*!< [15..15] Pmn Event Input Data                                             */
                } EIDR_b;
            };
        };
    };

    union
    {
        union
        {
            __OM uint32_t PCNTR3;        /*!< (@ 0x00000008) Port Control Register 3                                    */

            struct
            {
                __OM uint32_t POSR : 16; /*!< [15..0] Pmn Output Set                                                    */
                __OM uint32_t PORR : 16; /*!< [31..16] Pmn Output Reset                                                 */
            } PCNTR3_b;
        };

        struct
        {
            union
            {
                __OM uint16_t POSR;           /*!< (@ 0x00000008) Output reset register                                      */

                struct
                {
                    __OM uint16_t POSR0  : 1; /*!< [0..0] Pmn Output Set                                                     */
                    __OM uint16_t POSR1  : 1; /*!< [1..1] Pmn Output Set                                                     */
                    __OM uint16_t POSR2  : 1; /*!< [2..2] Pmn Output Set                                                     */
                    __OM uint16_t POSR3  : 1; /*!< [3..3] Pmn Output Set                                                     */
                    __OM uint16_t POSR4  : 1; /*!< [4..4] Pmn Output Set                                                     */
                    __OM uint16_t POSR5  : 1; /*!< [5..5] Pmn Output Set                                                     */
                    __OM uint16_t POSR6  : 1; /*!< [6..6] Pmn Output Set                                                     */
                    __OM uint16_t POSR7  : 1; /*!< [7..7] Pmn Output Set                                                     */
                    __OM uint16_t POSR8  : 1; /*!< [8..8] Pmn Output Set                                                     */
                    __OM uint16_t POSR9  : 1; /*!< [9..9] Pmn Output Set                                                     */
                    __OM uint16_t POSR10 : 1; /*!< [10..10] Pmn Output Set                                                   */
                    __OM uint16_t POSR11 : 1; /*!< [11..11] Pmn Output Set                                                   */
                    __OM uint16_t POSR12 : 1; /*!< [12..12] Pmn Output Set                                                   */
                    __OM uint16_t POSR13 : 1; /*!< [13..13] Pmn Output Set                                                   */
                    __OM uint16_t POSR14 : 1; /*!< [14..14] Pmn Output Set                                                   */
                    __OM uint16_t POSR15 : 1; /*!< [15..15] Pmn Output Set                                                   */
                } POSR_b;
            };

            union
            {
                __OM uint16_t PORR;           /*!< (@ 0x0000000A) Output set register                                        */

                struct
                {
                    __OM uint16_t PORR0  : 1; /*!< [0..0] Pmn Output Reset                                                   */
                    __OM uint16_t PORR1  : 1; /*!< [1..1] Pmn Output Reset                                                   */
                    __OM uint16_t PORR2  : 1; /*!< [2..2] Pmn Output Reset                                                   */
                    __OM uint16_t PORR3  : 1; /*!< [3..3] Pmn Output Reset                                                   */
                    __OM uint16_t PORR4  : 1; /*!< [4..4] Pmn Output Reset                                                   */
                    __OM uint16_t PORR5  : 1; /*!< [5..5] Pmn Output Reset                                                   */
                    __OM uint16_t PORR6  : 1; /*!< [6..6] Pmn Output Reset                                                   */
                    __OM uint16_t PORR7  : 1; /*!< [7..7] Pmn Output Reset                                                   */
                    __OM uint16_t PORR8  : 1; /*!< [8..8] Pmn Output Reset                                                   */
                    __OM uint16_t PORR9  : 1; /*!< [9..9] Pmn Output Reset                                                   */
                    __OM uint16_t PORR10 : 1; /*!< [10..10] Pmn Output Reset                                                 */
                    __OM uint16_t PORR11 : 1; /*!< [11..11] Pmn Output Reset                                                 */
                    __OM uint16_t PORR12 : 1; /*!< [12..12] Pmn Output Reset                                                 */
                    __OM uint16_t PORR13 : 1; /*!< [13..13] Pmn Output Reset                                                 */
                    __OM uint16_t PORR14 : 1; /*!< [14..14] Pmn Output Reset                                                 */
                    __OM uint16_t PORR15 : 1; /*!< [15..15] Pmn Output Reset                                                 */
                } PORR_b;
            };
        };
    };

    union
    {
        union
        {
            __IOM uint32_t PCNTR4;        /*!< (@ 0x0000000C) Port Control Register 4                                    */

            struct
            {
                __IOM uint32_t EOSR : 16; /*!< [15..0] Pmn Event Output Set                                              */
                __IOM uint32_t EORR : 16; /*!< [31..16] Pmn Event Output Reset                                           */
            } PCNTR4_b;
        };

        struct
        {
            union
            {
                __IOM uint16_t EOSR;           /*!< (@ 0x0000000C) Event output reset register                                */

                struct
                {
                    __IOM uint16_t EOSR0  : 1; /*!< [0..0] Pmn Event Output Set                                               */
                    __IOM uint16_t EOSR1  : 1; /*!< [1..1] Pmn Event Output Set                                               */
                    __IOM uint16_t EOSR2  : 1; /*!< [2..2] Pmn Event Output Set                                               */
                    __IOM uint16_t EOSR3  : 1; /*!< [3..3] Pmn Event Output Set                                               */
                    __IOM uint16_t EOSR4  : 1; /*!< [4..4] Pmn Event Output Set                                               */
                    __IOM uint16_t EOSR5  : 1; /*!< [5..5] Pmn Event Output Set                                               */
                    __IOM uint16_t EOSR6  : 1; /*!< [6..6] Pmn Event Output Set                                               */
                    __IOM uint16_t EOSR7  : 1; /*!< [7..7] Pmn Event Output Set                                               */
                    __IOM uint16_t EOSR8  : 1; /*!< [8..8] Pmn Event Output Set                                               */
                    __IOM uint16_t EOSR9  : 1; /*!< [9..9] Pmn Event Output Set                                               */
                    __IOM uint16_t EOSR10 : 1; /*!< [10..10] Pmn Event Output Set                                             */
                    __IOM uint16_t EOSR11 : 1; /*!< [11..11] Pmn Event Output Set                                             */
                    __IOM uint16_t EOSR12 : 1; /*!< [12..12] Pmn Event Output Set                                             */
                    __IOM uint16_t EOSR13 : 1; /*!< [13..13] Pmn Event Output Set                                             */
                    __IOM uint16_t EOSR14 : 1; /*!< [14..14] Pmn Event Output Set                                             */
                    __IOM uint16_t EOSR15 : 1; /*!< [15..15] Pmn Event Output Set                                             */
                } EOSR_b;
            };

            union
            {
                __IOM uint16_t EORR;           /*!< (@ 0x0000000E) Event output set register                                  */

                struct
                {
                    __IOM uint16_t EORR0  : 1; /*!< [0..0] Pmn Event Output Reset                                             */
                    __IOM uint16_t EORR1  : 1; /*!< [1..1] Pmn Event Output Reset                                             */
                    __IOM uint16_t EORR2  : 1; /*!< [2..2] Pmn Event Output Reset                                             */
                    __IOM uint16_t EORR3  : 1; /*!< [3..3] Pmn Event Output Reset                                             */
                    __IOM uint16_t EORR4  : 1; /*!< [4..4] Pmn Event Output Reset                                             */
                    __IOM uint16_t EORR5  : 1; /*!< [5..5] Pmn Event Output Reset                                             */
                    __IOM uint16_t EORR6  : 1; /*!< [6..6] Pmn Event Output Reset                                             */
                    __IOM uint16_t EORR7  : 1; /*!< [7..7] Pmn Event Output Reset                                             */
                    __IOM uint16_t EORR8  : 1; /*!< [8..8] Pmn Event Output Reset                                             */
                    __IOM uint16_t EORR9  : 1; /*!< [9..9] Pmn Event Output Reset                                             */
                    __IOM uint16_t EORR10 : 1; /*!< [10..10] Pmn Event Output Reset                                           */
                    __IOM uint16_t EORR11 : 1; /*!< [11..11] Pmn Event Output Reset                                           */
                    __IOM uint16_t EORR12 : 1; /*!< [12..12] Pmn Event Output Reset                                           */
                    __IOM uint16_t EORR13 : 1; /*!< [13..13] Pmn Event Output Reset                                           */
                    __IOM uint16_t EORR14 : 1; /*!< [14..14] Pmn Event Output Reset                                           */
                    __IOM uint16_t EORR15 : 1; /*!< [15..15] Pmn Event Output Reset                                           */
                } EORR_b;
            };
        };
    };
} R_PORT0_Type;                        /*!< Size = 16 (0x10)                                                          */

/* =========================================================================================================================== */
/* ================                                Pos/Mask Peripheral Section                                ================ */
/* =========================================================================================================================== */

/* =========================================================================================================================== */
/* ================                                           R_ELC                                           ================ */
/* =========================================================================================================================== */

/* =========================================================  ELCR  ========================================================== */
#define R_ELC_ELCR_ELCON_Pos         (7UL)          /*!< ELCON (Bit 7)                                         */
#define R_ELC_ELCR_ELCON_Msk         (0x80UL)       /*!< ELCON (Bitfield-Mask: 0x01)                           */
/* ========================================================  ELCSARA  ======================================================== */
#define R_ELC_ELCSARA_ELCR_Pos       (0UL)          /*!< ELCR (Bit 0)                                          */
#define R_ELC_ELCSARA_ELCR_Msk       (0x1UL)        /*!< ELCR (Bitfield-Mask: 0x01)                            */
#define R_ELC_ELCSARA_ELSEGR0_Pos    (1UL)          /*!< ELSEGR0 (Bit 1)                                       */
#define R_ELC_ELCSARA_ELSEGR0_Msk    (0x2UL)        /*!< ELSEGR0 (Bitfield-Mask: 0x01)                         */
#define R_ELC_ELCSARA_ELSEGR1_Pos    (2UL)          /*!< ELSEGR1 (Bit 2)                                       */
#define R_ELC_ELCSARA_ELSEGR1_Msk    (0x4UL)        /*!< ELSEGR1 (Bitfield-Mask: 0x01)                         */
/* ========================================================  ELCSARB  ======================================================== */
#define R_ELC_ELCSARB_ELSR0_Pos      (0UL)          /*!< ELSR0 (Bit 0)                                         */
#define R_ELC_ELCSARB_ELSR0_Msk      (0x1UL)        /*!< ELSR0 (Bitfield-Mask: 0x01)                           */
#define R_ELC_ELCSARB_ELSR1_Pos      (1UL)          /*!< ELSR1 (Bit 1)                                         */
#define R_ELC_ELCSARB_ELSR1_Msk      (0x2UL)        /*!< ELSR1 (Bitfield-Mask: 0x01)                           */
#define R_ELC_ELCSARB_ELSR2_Pos      (2UL)          /*!< ELSR2 (Bit 2)                                         */
#define R_ELC_ELCSARB_ELSR2_Msk      (0x4UL)        /*!< ELSR2 (Bitfield-Mask: 0x01)                           */
#define R_ELC_ELCSARB_ELSR3_Pos      (3UL)          /*!< ELSR3 (Bit 3)                                         */
#define R_ELC_ELCSARB_ELSR3_Msk      (0x8UL)        /*!< ELSR3 (Bitfield-Mask: 0x01)                           */
#define R_ELC_ELCSARB_ELSR4_Pos      (4UL)          /*!< ELSR4 (Bit 4)                                         */
#define R_ELC_ELCSARB_ELSR4_Msk      (0x10UL)       /*!< ELSR4 (Bitfield-Mask: 0x01)                           */
#define R_ELC_ELCSARB_ELSR5_Pos      (5UL)          /*!< ELSR5 (Bit 5)                                         */
#define R_ELC_ELCSARB_ELSR5_Msk      (0x20UL)       /*!< ELSR5 (Bitfield-Mask: 0x01)                           */
#define R_ELC_ELCSARB_ELSR6_Pos      (6UL)          /*!< ELSR6 (Bit 6)                                         */
#define R_ELC_ELCSARB_ELSR6_Msk      (0x40UL)       /*!< ELSR6 (Bitfield-Mask: 0x01)                           */
#define R_ELC_ELCSARB_ELSR7_Pos      (7UL)          /*!< ELSR7 (Bit 7)                                         */
#define R_ELC_ELCSARB_ELSR7_Msk      (0x80UL)       /*!< ELSR7 (Bitfield-Mask: 0x01)                           */
#define R_ELC_ELCSARB_ELSR12_Pos     (12UL)         /*!< ELSR12 (Bit 12)                                       */
#define R_ELC_ELCSARB_ELSR12_Msk     (0x1000UL)     /*!< ELSR12 (Bitfield-Mask: 0x01)                          */
#define R_ELC_ELCSARB_ELSR13_Pos     (13UL)         /*!< ELSR13 (Bit 13)                                       */
#define R_ELC_ELCSARB_ELSR13_Msk     (0x2000UL)     /*!< ELSR13 (Bitfield-Mask: 0x01)                          */
#define R_ELC_ELCSARB_ELSR14_Pos     (14UL)         /*!< ELSR14 (Bit 14)                                       */
#define R_ELC_ELCSARB_ELSR14_Msk     (0x4000UL)     /*!< ELSR14 (Bitfield-Mask: 0x01)                          */
#define R_ELC_ELCSARB_ELSR15_Pos     (15UL)         /*!< ELSR15 (Bit 15)                                       */
#define R_ELC_ELCSARB_ELSR15_Msk     (0x8000UL)     /*!< ELSR15 (Bitfield-Mask: 0x01)                          */
#define R_ELC_ELCSARB_ELSR16_Pos     (16UL)         /*!< ELSR16 (Bit 16)                                       */
#define R_ELC_ELCSARB_ELSR16_Msk     (0x10000UL)    /*!< ELSR16 (Bitfield-Mask: 0x01)                          */
#define R_ELC_ELCSARB_ELSR17_Pos     (17UL)         /*!< ELSR17 (Bit 17)                                       */
#define R_ELC_ELCSARB_ELSR17_Msk     (0x20000UL)    /*!< ELSR17 (Bitfield-Mask: 0x01)                          */
#define R_ELC_ELCSARB_ELSR19_Pos     (19UL)         /*!< ELSR19 (Bit 19)                                       */
#define R_ELC_ELCSARB_ELSR19_Msk     (0x80000UL)    /*!< ELSR19 (Bitfield-Mask: 0x01)                          */
#define R_ELC_ELCSARB_ELSR20_Pos     (20UL)         /*!< ELSR20 (Bit 20)                                       */
#define R_ELC_ELCSARB_ELSR20_Msk     (0x100000UL)   /*!< ELSR20 (Bitfield-Mask: 0x01)                          */
#define R_ELC_ELCSARB_ELSR21_Pos     (21UL)         /*!< ELSR21 (Bit 21)                                       */
#define R_ELC_ELCSARB_ELSR21_Msk     (0x200000UL)   /*!< ELSR21 (Bitfield-Mask: 0x01)                          */
#define R_ELC_ELCSARB_ELSR22_Pos     (22UL)         /*!< ELSR22 (Bit 22)                                       */
#define R_ELC_ELCSARB_ELSR22_Msk     (0x400000UL)   /*!< ELSR22 (Bitfield-Mask: 0x01)                          */
#define R_ELC_ELCSARB_ELSR23_Pos     (23UL)         /*!< ELSR23 (Bit 23)                                       */
#define R_ELC_ELCSARB_ELSR23_Msk     (0x800000UL)   /*!< ELSR23 (Bitfield-Mask: 0x01)                          */
#define R_ELC_ELCSARB_ELSR24_Pos     (24UL)         /*!< ELSR24 (Bit 24)                                       */
#define R_ELC_ELCSARB_ELSR24_Msk     (0x1000000UL)  /*!< ELSR24 (Bitfield-Mask: 0x01)                          */
#define R_ELC_ELCSARB_ELSR28_Pos     (28UL)         /*!< ELSR28 (Bit 28)                                       */
#define R_ELC_ELCSARB_ELSR28_Msk     (0x10000000UL) /*!< ELSR28 (Bitfield-Mask: 0x01)                          */
#define R_ELC_ELCSARB_ELSR29_Pos     (29UL)         /*!< ELSR29 (Bit 29)                                       */
#define R_ELC_ELCSARB_ELSR29_Msk     (0x20000000UL) /*!< ELSR29 (Bitfield-Mask: 0x01)                          */

/* =========================================================================================================================== */
/* ================                                           R_SYSTEM                                            ================ */
/* =========================================================================================================================== */

