renesas/fsp/ra/fsp/src/bsp/mcu/ra6t2/bsp_override_reg.h
/* =========================================================  SBYCR  ========================================================= */
#define R_SYSTEM_SBYCR_SSBY_Pos                   (15UL)         /*!< SSBY (Bit 15)                                         */
#define R_SYSTEM_SBYCR_SSBY_Msk                   (0x8000UL)     /*!< SSBY (Bitfield-Mask: 0x01)                            */
/* =======================================================  SCKDIVCR  ======================================================== */
#define R_SYSTEM_SCKDIVCR_PCKD_Pos                (0UL)          /*!< PCKD (Bit 0)                                          */
#define R_SYSTEM_SCKDIVCR_PCKD_Msk                (0x7UL)        /*!< PCKD (Bitfield-Mask: 0x07)                            */
#define R_SYSTEM_SCKDIVCR_PCKC_Pos                (4UL)          /*!< PCKC (Bit 4)                                          */
#define R_SYSTEM_SCKDIVCR_PCKC_Msk                (0x70UL)       /*!< PCKC (Bitfield-Mask: 0x07)                            */
#define R_SYSTEM_SCKDIVCR_PCKB_Pos                (8UL)          /*!< PCKB (Bit 8)                                          */
#define R_SYSTEM_SCKDIVCR_PCKB_Msk                (0x700UL)      /*!< PCKB (Bitfield-Mask: 0x07)                            */
#define R_SYSTEM_SCKDIVCR_PCKA_Pos                (12UL)         /*!< PCKA (Bit 12)                                         */
#define R_SYSTEM_SCKDIVCR_PCKA_Msk                (0x7000UL)     /*!< PCKA (Bitfield-Mask: 0x07)                            */
#define R_SYSTEM_SCKDIVCR_RSV_Pos                 (16UL)         /*!< RSV (Bit 16)                                          */
#define R_SYSTEM_SCKDIVCR_RSV_Msk                 (0x70000UL)    /*!< RSV (Bitfield-Mask: 0x07)                             */
#define R_SYSTEM_SCKDIVCR_ICK_Pos                 (24UL)         /*!< ICK (Bit 24)                                          */
#define R_SYSTEM_SCKDIVCR_ICK_Msk                 (0x7000000UL)  /*!< ICK (Bitfield-Mask: 0x07)                             */
#define R_SYSTEM_SCKDIVCR_FCK_Pos                 (28UL)         /*!< FCK (Bit 28)                                          */
#define R_SYSTEM_SCKDIVCR_FCK_Msk                 (0x70000000UL) /*!< FCK (Bitfield-Mask: 0x07)                             */
/* ========================================================  SCKSCR  ========================================================= */
#define R_SYSTEM_SCKSCR_CKSEL_Pos                 (0UL)          /*!< CKSEL (Bit 0)                                         */
#define R_SYSTEM_SCKSCR_CKSEL_Msk                 (0x7UL)        /*!< CKSEL (Bitfield-Mask: 0x07)                           */
/* ========================================================  PLLCCR  ========================================================= */
#define R_SYSTEM_PLLCCR_PLIDIV_Pos                (0UL)          /*!< PLIDIV (Bit 0)                                        */
#define R_SYSTEM_PLLCCR_PLIDIV_Msk                (0x3UL)        /*!< PLIDIV (Bitfield-Mask: 0x03)                          */
#define R_SYSTEM_PLLCCR_PLSRCSEL_Pos              (4UL)          /*!< PLSRCSEL (Bit 4)                                      */
#define R_SYSTEM_PLLCCR_PLSRCSEL_Msk              (0x10UL)       /*!< PLSRCSEL (Bitfield-Mask: 0x01)                        */
#define R_SYSTEM_PLLCCR_PLLMUL_Pos                (8UL)          /*!< PLLMUL (Bit 8)                                        */
#define R_SYSTEM_PLLCCR_PLLMUL_Msk                (0x3f00UL)     /*!< PLLMUL (Bitfield-Mask: 0x3f)                          */
/* =========================================================  PLLCR  ========================================================= */
#define R_SYSTEM_PLLCR_PLLSTP_Pos                 (0UL)          /*!< PLLSTP (Bit 0)                                        */
#define R_SYSTEM_PLLCR_PLLSTP_Msk                 (0x1UL)        /*!< PLLSTP (Bitfield-Mask: 0x01)                          */
/* ========================================================  MOSCCR  ========================================================= */
#define R_SYSTEM_MOSCCR_MOSTP_Pos                 (0UL)          /*!< MOSTP (Bit 0)                                         */
#define R_SYSTEM_MOSCCR_MOSTP_Msk                 (0x1UL)        /*!< MOSTP (Bitfield-Mask: 0x01)                           */
/* ========================================================  HOCOCR  ========================================================= */
#define R_SYSTEM_HOCOCR_HCSTP_Pos                 (0UL)          /*!< HCSTP (Bit 0)                                         */
#define R_SYSTEM_HOCOCR_HCSTP_Msk                 (0x1UL)        /*!< HCSTP (Bitfield-Mask: 0x01)                           */
/* ========================================================  MOCOCR  ========================================================= */
#define R_SYSTEM_MOCOCR_MCSTP_Pos                 (0UL)          /*!< MCSTP (Bit 0)                                         */
#define R_SYSTEM_MOCOCR_MCSTP_Msk                 (0x1UL)        /*!< MCSTP (Bitfield-Mask: 0x01)                           */
/* =========================================================  OSCSF  ========================================================= */
#define R_SYSTEM_OSCSF_HOCOSF_Pos                 (0UL)          /*!< HOCOSF (Bit 0)                                        */
#define R_SYSTEM_OSCSF_HOCOSF_Msk                 (0x1UL)        /*!< HOCOSF (Bitfield-Mask: 0x01)                          */
#define R_SYSTEM_OSCSF_MOSCSF_Pos                 (3UL)          /*!< MOSCSF (Bit 3)                                        */
#define R_SYSTEM_OSCSF_MOSCSF_Msk                 (0x8UL)        /*!< MOSCSF (Bitfield-Mask: 0x01)                          */
#define R_SYSTEM_OSCSF_PLLSF_Pos                  (5UL)          /*!< PLLSF (Bit 5)                                         */
#define R_SYSTEM_OSCSF_PLLSF_Msk                  (0x20UL)       /*!< PLLSF (Bitfield-Mask: 0x01)                           */
#define R_SYSTEM_OSCSF_PLL2SF_Pos                 (6UL)          /*!< PLL2SF (Bit 6)                                        */
#define R_SYSTEM_OSCSF_PLL2SF_Msk                 (0x40UL)       /*!< PLL2SF (Bitfield-Mask: 0x01)                          */
/* =========================================================  CKOCR  ========================================================= */
#define R_SYSTEM_CKOCR_CKOSEL_Pos                 (0UL)          /*!< CKOSEL (Bit 0)                                        */
#define R_SYSTEM_CKOCR_CKOSEL_Msk                 (0x7UL)        /*!< CKOSEL (Bitfield-Mask: 0x07)                          */
#define R_SYSTEM_CKOCR_CKODIV_Pos                 (4UL)          /*!< CKODIV (Bit 4)                                        */
#define R_SYSTEM_CKOCR_CKODIV_Msk                 (0x70UL)       /*!< CKODIV (Bitfield-Mask: 0x07)                          */
#define R_SYSTEM_CKOCR_CKOEN_Pos                  (7UL)          /*!< CKOEN (Bit 7)                                         */
#define R_SYSTEM_CKOCR_CKOEN_Msk                  (0x80UL)       /*!< CKOEN (Bitfield-Mask: 0x01)                           */
/* ========================================================  TRCKCR  ========================================================= */
#define R_SYSTEM_TRCKCR_TRCK_Pos                  (0UL)          /*!< TRCK (Bit 0)                                          */
#define R_SYSTEM_TRCKCR_TRCK_Msk                  (0xfUL)        /*!< TRCK (Bitfield-Mask: 0x0f)                            */
#define R_SYSTEM_TRCKCR_TRCKEN_Pos                (7UL)          /*!< TRCKEN (Bit 7)                                        */
#define R_SYSTEM_TRCKCR_TRCKEN_Msk                (0x80UL)       /*!< TRCKEN (Bitfield-Mask: 0x01)                          */
/* ========================================================  OSTDCR  ========================================================= */
#define R_SYSTEM_OSTDCR_OSTDIE_Pos                (0UL)          /*!< OSTDIE (Bit 0)                                        */
#define R_SYSTEM_OSTDCR_OSTDIE_Msk                (0x1UL)        /*!< OSTDIE (Bitfield-Mask: 0x01)                          */
#define R_SYSTEM_OSTDCR_OSTDE_Pos                 (7UL)          /*!< OSTDE (Bit 7)                                         */
#define R_SYSTEM_OSTDCR_OSTDE_Msk                 (0x80UL)       /*!< OSTDE (Bitfield-Mask: 0x01)                           */
/* ========================================================  OSTDSR  ========================================================= */
#define R_SYSTEM_OSTDSR_OSTDF_Pos                 (0UL)          /*!< OSTDF (Bit 0)                                         */
#define R_SYSTEM_OSTDSR_OSTDF_Msk                 (0x1UL)        /*!< OSTDF (Bitfield-Mask: 0x01)                           */
/* ========================================================  PLL2CCR  ======================================================== */
#define R_SYSTEM_PLL2CCR_PL2IDIV_Pos              (0UL)          /*!< PL2IDIV (Bit 0)                                       */
#define R_SYSTEM_PLL2CCR_PL2IDIV_Msk              (0x3UL)        /*!< PL2IDIV (Bitfield-Mask: 0x03)                         */
#define R_SYSTEM_PLL2CCR_PL2SRCSEL_Pos            (4UL)          /*!< PL2SRCSEL (Bit 4)                                     */
#define R_SYSTEM_PLL2CCR_PL2SRCSEL_Msk            (0x10UL)       /*!< PL2SRCSEL (Bitfield-Mask: 0x01)                       */
#define R_SYSTEM_PLL2CCR_PLL2MUL_Pos              (8UL)          /*!< PLL2MUL (Bit 8)                                       */
#define R_SYSTEM_PLL2CCR_PLL2MUL_Msk              (0x3f00UL)     /*!< PLL2MUL (Bitfield-Mask: 0x3f)                         */
/* ========================================================  PLL2CR  ========================================================= */
#define R_SYSTEM_PLL2CR_PLL2STP_Pos               (0UL)          /*!< PLL2STP (Bit 0)                                       */
#define R_SYSTEM_PLL2CR_PLL2STP_Msk               (0x1UL)        /*!< PLL2STP (Bitfield-Mask: 0x01)                         */
/* =======================================================  MOCOUTCR  ======================================================== */
#define R_SYSTEM_MOCOUTCR_MOCOUTRM_Pos            (0UL)          /*!< MOCOUTRM (Bit 0)                                      */
#define R_SYSTEM_MOCOUTCR_MOCOUTRM_Msk            (0xffUL)       /*!< MOCOUTRM (Bitfield-Mask: 0xff)                        */
/* =======================================================  HOCOUTCR  ======================================================== */
#define R_SYSTEM_HOCOUTCR_HOCOUTRM_Pos            (0UL)          /*!< HOCOUTRM (Bit 0)                                      */
#define R_SYSTEM_HOCOUTCR_HOCOUTRM_Msk            (0xffUL)       /*!< HOCOUTRM (Bitfield-Mask: 0xff)                        */
/* =====================================================  SCISPICKDIVCR  ===================================================== */
#define R_SYSTEM_SCISPICKDIVCR_SCISPICKDIV_Pos    (0UL)          /*!< SCISPICKDIV (Bit 0)                                   */
#define R_SYSTEM_SCISPICKDIVCR_SCISPICKDIV_Msk    (0x7UL)        /*!< SCISPICKDIV (Bitfield-Mask: 0x07)                     */
/* =====================================================  CANFDCKDIVCR  ====================================================== */
#define R_SYSTEM_CANFDCKDIVCR_CANFDCKDIV_Pos      (0UL)          /*!< CANFDCKDIV (Bit 0)                                    */
#define R_SYSTEM_CANFDCKDIVCR_CANFDCKDIV_Msk      (0x7UL)        /*!< CANFDCKDIV (Bitfield-Mask: 0x07)                      */
/* ======================================================  GPTCKDIVCR  ======================================================= */
#define R_SYSTEM_GPTCKDIVCR_GPTCKDIV_Pos          (0UL)          /*!< GPTCKDIV (Bit 0)                                      */
#define R_SYSTEM_GPTCKDIVCR_GPTCKDIV_Msk          (0x7UL)        /*!< GPTCKDIV (Bitfield-Mask: 0x07)                        */
/* ======================================================  IICCKDIVCR  ======================================================= */
#define R_SYSTEM_IICCKDIVCR_IICCKDIV_Pos          (0UL)          /*!< IICCKDIV (Bit 0)                                      */
#define R_SYSTEM_IICCKDIVCR_IICCKDIV_Msk          (0x7UL)        /*!< IICCKDIV (Bitfield-Mask: 0x07)                        */
/* ======================================================  SCISPICKCR  ======================================================= */
#define R_SYSTEM_SCISPICKCR_SCISPICKSEL_Pos       (0UL)          /*!< SCISPICKSEL (Bit 0)                                   */
#define R_SYSTEM_SCISPICKCR_SCISPICKSEL_Msk       (0x7UL)        /*!< SCISPICKSEL (Bitfield-Mask: 0x07)                     */
#define R_SYSTEM_SCISPICKCR_SCISPICKSREQ_Pos      (6UL)          /*!< SCISPICKSREQ (Bit 6)                                  */
#define R_SYSTEM_SCISPICKCR_SCISPICKSREQ_Msk      (0x40UL)       /*!< SCISPICKSREQ (Bitfield-Mask: 0x01)                    */
#define R_SYSTEM_SCISPICKCR_SCISPICKSRDY_Pos      (7UL)          /*!< SCISPICKSRDY (Bit 7)                                  */
#define R_SYSTEM_SCISPICKCR_SCISPICKSRDY_Msk      (0x80UL)       /*!< SCISPICKSRDY (Bitfield-Mask: 0x01)                    */
/* =======================================================  CANFDCKCR  ======================================================= */
#define R_SYSTEM_CANFDCKCR_CANFDCKSEL_Pos         (0UL)          /*!< CANFDCKSEL (Bit 0)                                    */
#define R_SYSTEM_CANFDCKCR_CANFDCKSEL_Msk         (0x7UL)        /*!< CANFDCKSEL (Bitfield-Mask: 0x07)                      */
#define R_SYSTEM_CANFDCKCR_CANFDCKSREQ_Pos        (6UL)          /*!< CANFDCKSREQ (Bit 6)                                   */
#define R_SYSTEM_CANFDCKCR_CANFDCKSREQ_Msk        (0x40UL)       /*!< CANFDCKSREQ (Bitfield-Mask: 0x01)                     */
#define R_SYSTEM_CANFDCKCR_CANFDCKSRDY_Pos        (7UL)          /*!< CANFDCKSRDY (Bit 7)                                   */
#define R_SYSTEM_CANFDCKCR_CANFDCKSRDY_Msk        (0x80UL)       /*!< CANFDCKSRDY (Bitfield-Mask: 0x01)                     */
/* ========================================================  GPTCKCR  ======================================================== */
#define R_SYSTEM_GPTCKCR_GPTCKSEL_Pos             (0UL)          /*!< GPTCKSEL (Bit 0)                                      */
#define R_SYSTEM_GPTCKCR_GPTCKSEL_Msk             (0x7UL)        /*!< GPTCKSEL (Bitfield-Mask: 0x07)                        */
#define R_SYSTEM_GPTCKCR_GPTCKSREQ_Pos            (6UL)          /*!< GPTCKSREQ (Bit 6)                                     */
#define R_SYSTEM_GPTCKCR_GPTCKSREQ_Msk            (0x40UL)       /*!< GPTCKSREQ (Bitfield-Mask: 0x01)                       */
#define R_SYSTEM_GPTCKCR_GPTCKSRDY_Pos            (7UL)          /*!< GPTCKSRDY (Bit 7)                                     */
#define R_SYSTEM_GPTCKCR_GPTCKSRDY_Msk            (0x80UL)       /*!< GPTCKSRDY (Bitfield-Mask: 0x01)                       */
/* ========================================================  IICCKCR  ======================================================== */
#define R_SYSTEM_IICCKCR_IICCKSEL_Pos             (0UL)          /*!< IICCKSEL (Bit 0)                                      */
#define R_SYSTEM_IICCKCR_IICCKSEL_Msk             (0x7UL)        /*!< IICCKSEL (Bitfield-Mask: 0x07)                        */
#define R_SYSTEM_IICCKCR_IICCKSREQ_Pos            (6UL)          /*!< IICCKSREQ (Bit 6)                                     */
#define R_SYSTEM_IICCKCR_IICCKSREQ_Msk            (0x40UL)       /*!< IICCKSREQ (Bitfield-Mask: 0x01)                       */
#define R_SYSTEM_IICCKCR_IICCKSRDY_Pos            (7UL)          /*!< IICCKSRDY (Bit 7)                                     */
#define R_SYSTEM_IICCKCR_IICCKSRDY_Msk            (0x80UL)       /*!< IICCKSRDY (Bitfield-Mask: 0x01)                       */
/* =========================================================  SNZCR  ========================================================= */
#define R_SYSTEM_SNZCR_RXDREQEN_Pos               (0UL)          /*!< RXDREQEN (Bit 0)                                      */
#define R_SYSTEM_SNZCR_RXDREQEN_Msk               (0x1UL)        /*!< RXDREQEN (Bitfield-Mask: 0x01)                        */
#define R_SYSTEM_SNZCR_SNZDTCEN_Pos               (1UL)          /*!< SNZDTCEN (Bit 1)                                      */
#define R_SYSTEM_SNZCR_SNZDTCEN_Msk               (0x2UL)        /*!< SNZDTCEN (Bitfield-Mask: 0x01)                        */
#define R_SYSTEM_SNZCR_SNZE_Pos                   (7UL)          /*!< SNZE (Bit 7)                                          */
#define R_SYSTEM_SNZCR_SNZE_Msk                   (0x80UL)       /*!< SNZE (Bitfield-Mask: 0x01)                            */
/* =======================================================  SNZEDCR0  ======================================================== */
#define R_SYSTEM_SNZEDCR0_AGTUNFED_Pos            (0UL)          /*!< AGTUNFED (Bit 0)                                      */
#define R_SYSTEM_SNZEDCR0_AGTUNFED_Msk            (0x1UL)        /*!< AGTUNFED (Bitfield-Mask: 0x01)                        */
#define R_SYSTEM_SNZEDCR0_DTCZRED_Pos             (1UL)          /*!< DTCZRED (Bit 1)                                       */
#define R_SYSTEM_SNZEDCR0_DTCZRED_Msk             (0x2UL)        /*!< DTCZRED (Bitfield-Mask: 0x01)                         */
#define R_SYSTEM_SNZEDCR0_DTCNZRED_Pos            (2UL)          /*!< DTCNZRED (Bit 2)                                      */
#define R_SYSTEM_SNZEDCR0_DTCNZRED_Msk            (0x4UL)        /*!< DTCNZRED (Bitfield-Mask: 0x01)                        */
#define R_SYSTEM_SNZEDCR0_AD0MATED_Pos            (3UL)          /*!< AD0MATED (Bit 3)                                      */
#define R_SYSTEM_SNZEDCR0_AD0MATED_Msk            (0x8UL)        /*!< AD0MATED (Bitfield-Mask: 0x01)                        */
#define R_SYSTEM_SNZEDCR0_AD1MATED_Pos            (5UL)          /*!< AD1MATED (Bit 5)                                      */
#define R_SYSTEM_SNZEDCR0_AD1MATED_Msk            (0x20UL)       /*!< AD1MATED (Bitfield-Mask: 0x01)                        */
#define R_SYSTEM_SNZEDCR0_SCI0UMTED_Pos           (7UL)          /*!< SCI0UMTED (Bit 7)                                     */
#define R_SYSTEM_SNZEDCR0_SCI0UMTED_Msk           (0x80UL)       /*!< SCI0UMTED (Bitfield-Mask: 0x01)                       */
/* =======================================================  SNZREQCR0  ======================================================= */
#define R_SYSTEM_SNZREQCR0_SNZREQEN0_Pos          (0UL)          /*!< SNZREQEN0 (Bit 0)                                     */
#define R_SYSTEM_SNZREQCR0_SNZREQEN0_Msk          (0x1UL)        /*!< SNZREQEN0 (Bitfield-Mask: 0x01)                       */
#define R_SYSTEM_SNZREQCR0_SNZREQEN1_Pos          (1UL)          /*!< SNZREQEN1 (Bit 1)                                     */
#define R_SYSTEM_SNZREQCR0_SNZREQEN1_Msk          (0x2UL)        /*!< SNZREQEN1 (Bitfield-Mask: 0x01)                       */
#define R_SYSTEM_SNZREQCR0_SNZREQEN2_Pos          (2UL)          /*!< SNZREQEN2 (Bit 2)                                     */
#define R_SYSTEM_SNZREQCR0_SNZREQEN2_Msk          (0x4UL)        /*!< SNZREQEN2 (Bitfield-Mask: 0x01)                       */
#define R_SYSTEM_SNZREQCR0_SNZREQEN3_Pos          (3UL)          /*!< SNZREQEN3 (Bit 3)                                     */
#define R_SYSTEM_SNZREQCR0_SNZREQEN3_Msk          (0x8UL)        /*!< SNZREQEN3 (Bitfield-Mask: 0x01)                       */
#define R_SYSTEM_SNZREQCR0_SNZREQEN4_Pos          (4UL)          /*!< SNZREQEN4 (Bit 4)                                     */
#define R_SYSTEM_SNZREQCR0_SNZREQEN4_Msk          (0x10UL)       /*!< SNZREQEN4 (Bitfield-Mask: 0x01)                       */
#define R_SYSTEM_SNZREQCR0_SNZREQEN5_Pos          (5UL)          /*!< SNZREQEN5 (Bit 5)                                     */
#define R_SYSTEM_SNZREQCR0_SNZREQEN5_Msk          (0x20UL)       /*!< SNZREQEN5 (Bitfield-Mask: 0x01)                       */
#define R_SYSTEM_SNZREQCR0_SNZREQEN6_Pos          (6UL)          /*!< SNZREQEN6 (Bit 6)                                     */
#define R_SYSTEM_SNZREQCR0_SNZREQEN6_Msk          (0x40UL)       /*!< SNZREQEN6 (Bitfield-Mask: 0x01)                       */
#define R_SYSTEM_SNZREQCR0_SNZREQEN7_Pos          (7UL)          /*!< SNZREQEN7 (Bit 7)                                     */
#define R_SYSTEM_SNZREQCR0_SNZREQEN7_Msk          (0x80UL)       /*!< SNZREQEN7 (Bitfield-Mask: 0x01)                       */
#define R_SYSTEM_SNZREQCR0_SNZREQEN8_Pos          (8UL)          /*!< SNZREQEN8 (Bit 8)                                     */
#define R_SYSTEM_SNZREQCR0_SNZREQEN8_Msk          (0x100UL)      /*!< SNZREQEN8 (Bitfield-Mask: 0x01)                       */
#define R_SYSTEM_SNZREQCR0_SNZREQEN9_Pos          (9UL)          /*!< SNZREQEN9 (Bit 9)                                     */
#define R_SYSTEM_SNZREQCR0_SNZREQEN9_Msk          (0x200UL)      /*!< SNZREQEN9 (Bitfield-Mask: 0x01)                       */
#define R_SYSTEM_SNZREQCR0_SNZREQEN10_Pos         (10UL)         /*!< SNZREQEN10 (Bit 10)                                   */
#define R_SYSTEM_SNZREQCR0_SNZREQEN10_Msk         (0x400UL)      /*!< SNZREQEN10 (Bitfield-Mask: 0x01)                      */
#define R_SYSTEM_SNZREQCR0_SNZREQEN11_Pos         (11UL)         /*!< SNZREQEN11 (Bit 11)                                   */
#define R_SYSTEM_SNZREQCR0_SNZREQEN11_Msk         (0x800UL)      /*!< SNZREQEN11 (Bitfield-Mask: 0x01)                      */
#define R_SYSTEM_SNZREQCR0_SNZREQEN12_Pos         (12UL)         /*!< SNZREQEN12 (Bit 12)                                   */
#define R_SYSTEM_SNZREQCR0_SNZREQEN12_Msk         (0x1000UL)     /*!< SNZREQEN12 (Bitfield-Mask: 0x01)                      */
#define R_SYSTEM_SNZREQCR0_SNZREQEN13_Pos         (13UL)         /*!< SNZREQEN13 (Bit 13)                                   */
#define R_SYSTEM_SNZREQCR0_SNZREQEN13_Msk         (0x2000UL)     /*!< SNZREQEN13 (Bitfield-Mask: 0x01)                      */
#define R_SYSTEM_SNZREQCR0_SNZREQEN14_Pos         (14UL)         /*!< SNZREQEN14 (Bit 14)                                   */
#define R_SYSTEM_SNZREQCR0_SNZREQEN14_Msk         (0x4000UL)     /*!< SNZREQEN14 (Bitfield-Mask: 0x01)                      */
#define R_SYSTEM_SNZREQCR0_SNZREQEN15_Pos         (15UL)         /*!< SNZREQEN15 (Bit 15)                                   */
#define R_SYSTEM_SNZREQCR0_SNZREQEN15_Msk         (0x8000UL)     /*!< SNZREQEN15 (Bitfield-Mask: 0x01)                      */
#define R_SYSTEM_SNZREQCR0_SNZREQEN17_Pos         (17UL)         /*!< SNZREQEN17 (Bit 17)                                   */
#define R_SYSTEM_SNZREQCR0_SNZREQEN17_Msk         (0x20000UL)    /*!< SNZREQEN17 (Bitfield-Mask: 0x01)                      */
#define R_SYSTEM_SNZREQCR0_SNZREQEN28_Pos         (28UL)         /*!< SNZREQEN28 (Bit 28)                                   */
#define R_SYSTEM_SNZREQCR0_SNZREQEN28_Msk         (0x10000000UL) /*!< SNZREQEN28 (Bitfield-Mask: 0x01)                      */
#define R_SYSTEM_SNZREQCR0_SNZREQEN29_Pos         (29UL)         /*!< SNZREQEN29 (Bit 29)                                   */
#define R_SYSTEM_SNZREQCR0_SNZREQEN29_Msk         (0x20000000UL) /*!< SNZREQEN29 (Bitfield-Mask: 0x01)                      */
#define R_SYSTEM_SNZREQCR0_SNZREQEN30_Pos         (30UL)         /*!< SNZREQEN30 (Bit 30)                                   */
#define R_SYSTEM_SNZREQCR0_SNZREQEN30_Msk         (0x40000000UL) /*!< SNZREQEN30 (Bitfield-Mask: 0x01)                      */
/* =========================================================  OPCCR  ========================================================= */
#define R_SYSTEM_OPCCR_OPCM_Pos                   (0UL)          /*!< OPCM (Bit 0)                                          */
