renesas/fsp/ra/fsp/src/bsp/mcu/ra6t2/bsp_override_reg.h
#define R_SYSTEM_DPSIER2_DLVD1IE_Pos              (0UL)          /*!< DLVD1IE (Bit 0)                                       */
#define R_SYSTEM_DPSIER2_DLVD1IE_Msk              (0x1UL)        /*!< DLVD1IE (Bitfield-Mask: 0x01)                         */
#define R_SYSTEM_DPSIER2_DLVD2IE_Pos              (1UL)          /*!< DLVD2IE (Bit 1)                                       */
#define R_SYSTEM_DPSIER2_DLVD2IE_Msk              (0x2UL)        /*!< DLVD2IE (Bitfield-Mask: 0x01)                         */
#define R_SYSTEM_DPSIER2_DNMIE_Pos                (4UL)          /*!< DNMIE (Bit 4)                                         */
#define R_SYSTEM_DPSIER2_DNMIE_Msk                (0x10UL)       /*!< DNMIE (Bitfield-Mask: 0x01)                           */
/* ========================================================  DPSIFR0  ======================================================== */
#define R_SYSTEM_DPSIFR0_DIRQ0F_Pos               (0UL)          /*!< DIRQ0F (Bit 0)                                        */
#define R_SYSTEM_DPSIFR0_DIRQ0F_Msk               (0x1UL)        /*!< DIRQ0F (Bitfield-Mask: 0x01)                          */
#define R_SYSTEM_DPSIFR0_DIRQ1F_Pos               (1UL)          /*!< DIRQ1F (Bit 1)                                        */
#define R_SYSTEM_DPSIFR0_DIRQ1F_Msk               (0x2UL)        /*!< DIRQ1F (Bitfield-Mask: 0x01)                          */
#define R_SYSTEM_DPSIFR0_DIRQ2F_Pos               (2UL)          /*!< DIRQ2F (Bit 2)                                        */
#define R_SYSTEM_DPSIFR0_DIRQ2F_Msk               (0x4UL)        /*!< DIRQ2F (Bitfield-Mask: 0x01)                          */
#define R_SYSTEM_DPSIFR0_DIRQ3F_Pos               (3UL)          /*!< DIRQ3F (Bit 3)                                        */
#define R_SYSTEM_DPSIFR0_DIRQ3F_Msk               (0x8UL)        /*!< DIRQ3F (Bitfield-Mask: 0x01)                          */
#define R_SYSTEM_DPSIFR0_DIRQ4F_Pos               (4UL)          /*!< DIRQ4F (Bit 4)                                        */
#define R_SYSTEM_DPSIFR0_DIRQ4F_Msk               (0x10UL)       /*!< DIRQ4F (Bitfield-Mask: 0x01)                          */
#define R_SYSTEM_DPSIFR0_DIRQ5F_Pos               (5UL)          /*!< DIRQ5F (Bit 5)                                        */
#define R_SYSTEM_DPSIFR0_DIRQ5F_Msk               (0x20UL)       /*!< DIRQ5F (Bitfield-Mask: 0x01)                          */
#define R_SYSTEM_DPSIFR0_DIRQ6F_Pos               (6UL)          /*!< DIRQ6F (Bit 6)                                        */
#define R_SYSTEM_DPSIFR0_DIRQ6F_Msk               (0x40UL)       /*!< DIRQ6F (Bitfield-Mask: 0x01)                          */
#define R_SYSTEM_DPSIFR0_DIRQ7F_Pos               (7UL)          /*!< DIRQ7F (Bit 7)                                        */
#define R_SYSTEM_DPSIFR0_DIRQ7F_Msk               (0x80UL)       /*!< DIRQ7F (Bitfield-Mask: 0x01)                          */
/* ========================================================  DPSIFR1  ======================================================== */
#define R_SYSTEM_DPSIFR1_DIRQ8F_Pos               (0UL)          /*!< DIRQ8F (Bit 0)                                        */
#define R_SYSTEM_DPSIFR1_DIRQ8F_Msk               (0x1UL)        /*!< DIRQ8F (Bitfield-Mask: 0x01)                          */
#define R_SYSTEM_DPSIFR1_DIRQ9F_Pos               (1UL)          /*!< DIRQ9F (Bit 1)                                        */
#define R_SYSTEM_DPSIFR1_DIRQ9F_Msk               (0x2UL)        /*!< DIRQ9F (Bitfield-Mask: 0x01)                          */
#define R_SYSTEM_DPSIFR1_DIRQ10F_Pos              (2UL)          /*!< DIRQ10F (Bit 2)                                       */
#define R_SYSTEM_DPSIFR1_DIRQ10F_Msk              (0x4UL)        /*!< DIRQ10F (Bitfield-Mask: 0x01)                         */
#define R_SYSTEM_DPSIFR1_DIRQ11F_Pos              (3UL)          /*!< DIRQ11F (Bit 3)                                       */
#define R_SYSTEM_DPSIFR1_DIRQ11F_Msk              (0x8UL)        /*!< DIRQ11F (Bitfield-Mask: 0x01)                         */
#define R_SYSTEM_DPSIFR1_DIRQ12F_Pos              (4UL)          /*!< DIRQ12F (Bit 4)                                       */
#define R_SYSTEM_DPSIFR1_DIRQ12F_Msk              (0x10UL)       /*!< DIRQ12F (Bitfield-Mask: 0x01)                         */
#define R_SYSTEM_DPSIFR1_DIRQ13F_Pos              (5UL)          /*!< DIRQ13F (Bit 5)                                       */
#define R_SYSTEM_DPSIFR1_DIRQ13F_Msk              (0x20UL)       /*!< DIRQ13F (Bitfield-Mask: 0x01)                         */
#define R_SYSTEM_DPSIFR1_DIRQ14F_Pos              (6UL)          /*!< DIRQ14F (Bit 6)                                       */
#define R_SYSTEM_DPSIFR1_DIRQ14F_Msk              (0x40UL)       /*!< DIRQ14F (Bitfield-Mask: 0x01)                         */
#define R_SYSTEM_DPSIFR1_DIRQ15F_Pos              (7UL)          /*!< DIRQ15F (Bit 7)                                       */
#define R_SYSTEM_DPSIFR1_DIRQ15F_Msk              (0x80UL)       /*!< DIRQ15F (Bitfield-Mask: 0x01)                         */
/* ========================================================  DPSIFR2  ======================================================== */
#define R_SYSTEM_DPSIFR2_DLVD1IF_Pos              (0UL)          /*!< DLVD1IF (Bit 0)                                       */
#define R_SYSTEM_DPSIFR2_DLVD1IF_Msk              (0x1UL)        /*!< DLVD1IF (Bitfield-Mask: 0x01)                         */
#define R_SYSTEM_DPSIFR2_DLVD2IF_Pos              (1UL)          /*!< DLVD2IF (Bit 1)                                       */
#define R_SYSTEM_DPSIFR2_DLVD2IF_Msk              (0x2UL)        /*!< DLVD2IF (Bitfield-Mask: 0x01)                         */
#define R_SYSTEM_DPSIFR2_DNMIF_Pos                (4UL)          /*!< DNMIF (Bit 4)                                         */
#define R_SYSTEM_DPSIFR2_DNMIF_Msk                (0x10UL)       /*!< DNMIF (Bitfield-Mask: 0x01)                           */
/* =======================================================  DPSIEGR0  ======================================================== */
#define R_SYSTEM_DPSIEGR0_DIRQ0EG_Pos             (0UL)          /*!< DIRQ0EG (Bit 0)                                       */
#define R_SYSTEM_DPSIEGR0_DIRQ0EG_Msk             (0x1UL)        /*!< DIRQ0EG (Bitfield-Mask: 0x01)                         */
#define R_SYSTEM_DPSIEGR0_DIRQ1EG_Pos             (1UL)          /*!< DIRQ1EG (Bit 1)                                       */
#define R_SYSTEM_DPSIEGR0_DIRQ1EG_Msk             (0x2UL)        /*!< DIRQ1EG (Bitfield-Mask: 0x01)                         */
#define R_SYSTEM_DPSIEGR0_DIRQ2EG_Pos             (2UL)          /*!< DIRQ2EG (Bit 2)                                       */
#define R_SYSTEM_DPSIEGR0_DIRQ2EG_Msk             (0x4UL)        /*!< DIRQ2EG (Bitfield-Mask: 0x01)                         */
#define R_SYSTEM_DPSIEGR0_DIRQ3EG_Pos             (3UL)          /*!< DIRQ3EG (Bit 3)                                       */
#define R_SYSTEM_DPSIEGR0_DIRQ3EG_Msk             (0x8UL)        /*!< DIRQ3EG (Bitfield-Mask: 0x01)                         */
#define R_SYSTEM_DPSIEGR0_DIRQ4EG_Pos             (4UL)          /*!< DIRQ4EG (Bit 4)                                       */
#define R_SYSTEM_DPSIEGR0_DIRQ4EG_Msk             (0x10UL)       /*!< DIRQ4EG (Bitfield-Mask: 0x01)                         */
#define R_SYSTEM_DPSIEGR0_DIRQ5EG_Pos             (5UL)          /*!< DIRQ5EG (Bit 5)                                       */
#define R_SYSTEM_DPSIEGR0_DIRQ5EG_Msk             (0x20UL)       /*!< DIRQ5EG (Bitfield-Mask: 0x01)                         */
#define R_SYSTEM_DPSIEGR0_DIRQ6EG_Pos             (6UL)          /*!< DIRQ6EG (Bit 6)                                       */
#define R_SYSTEM_DPSIEGR0_DIRQ6EG_Msk             (0x40UL)       /*!< DIRQ6EG (Bitfield-Mask: 0x01)                         */
#define R_SYSTEM_DPSIEGR0_DIRQ7EG_Pos             (7UL)          /*!< DIRQ7EG (Bit 7)                                       */
#define R_SYSTEM_DPSIEGR0_DIRQ7EG_Msk             (0x80UL)       /*!< DIRQ7EG (Bitfield-Mask: 0x01)                         */
/* =======================================================  DPSIEGR1  ======================================================== */
#define R_SYSTEM_DPSIEGR1_DIRQ8EG_Pos             (0UL)          /*!< DIRQ8EG (Bit 0)                                       */
#define R_SYSTEM_DPSIEGR1_DIRQ8EG_Msk             (0x1UL)        /*!< DIRQ8EG (Bitfield-Mask: 0x01)                         */
#define R_SYSTEM_DPSIEGR1_DIRQ9EG_Pos             (1UL)          /*!< DIRQ9EG (Bit 1)                                       */
#define R_SYSTEM_DPSIEGR1_DIRQ9EG_Msk             (0x2UL)        /*!< DIRQ9EG (Bitfield-Mask: 0x01)                         */
#define R_SYSTEM_DPSIEGR1_DIRQ10EG_Pos            (2UL)          /*!< DIRQ10EG (Bit 2)                                      */
#define R_SYSTEM_DPSIEGR1_DIRQ10EG_Msk            (0x4UL)        /*!< DIRQ10EG (Bitfield-Mask: 0x01)                        */
#define R_SYSTEM_DPSIEGR1_DIRQ11EG_Pos            (3UL)          /*!< DIRQ11EG (Bit 3)                                      */
#define R_SYSTEM_DPSIEGR1_DIRQ11EG_Msk            (0x8UL)        /*!< DIRQ11EG (Bitfield-Mask: 0x01)                        */
#define R_SYSTEM_DPSIEGR1_DIRQ12EG_Pos            (4UL)          /*!< DIRQ12EG (Bit 4)                                      */
#define R_SYSTEM_DPSIEGR1_DIRQ12EG_Msk            (0x10UL)       /*!< DIRQ12EG (Bitfield-Mask: 0x01)                        */
#define R_SYSTEM_DPSIEGR1_DIRQ13EG_Pos            (5UL)          /*!< DIRQ13EG (Bit 5)                                      */
#define R_SYSTEM_DPSIEGR1_DIRQ13EG_Msk            (0x20UL)       /*!< DIRQ13EG (Bitfield-Mask: 0x01)                        */
#define R_SYSTEM_DPSIEGR1_DIRQ14EG_Pos            (6UL)          /*!< DIRQ14EG (Bit 6)                                      */
#define R_SYSTEM_DPSIEGR1_DIRQ14EG_Msk            (0x40UL)       /*!< DIRQ14EG (Bitfield-Mask: 0x01)                        */
#define R_SYSTEM_DPSIEGR1_DIRQ15EG_Pos            (7UL)          /*!< DIRQ15EG (Bit 7)                                      */
#define R_SYSTEM_DPSIEGR1_DIRQ15EG_Msk            (0x80UL)       /*!< DIRQ15EG (Bitfield-Mask: 0x01)                        */
/* =======================================================  DPSIEGR2  ======================================================== */
#define R_SYSTEM_DPSIEGR2_DLVD1EG_Pos             (0UL)          /*!< DLVD1EG (Bit 0)                                       */
#define R_SYSTEM_DPSIEGR2_DLVD1EG_Msk             (0x1UL)        /*!< DLVD1EG (Bitfield-Mask: 0x01)                         */
#define R_SYSTEM_DPSIEGR2_DLVD2EG_Pos             (1UL)          /*!< DLVD2EG (Bit 1)                                       */
#define R_SYSTEM_DPSIEGR2_DLVD2EG_Msk             (0x2UL)        /*!< DLVD2EG (Bitfield-Mask: 0x01)                         */
#define R_SYSTEM_DPSIEGR2_DNMIEG_Pos              (4UL)          /*!< DNMIEG (Bit 4)                                        */
#define R_SYSTEM_DPSIEGR2_DNMIEG_Msk              (0x10UL)       /*!< DNMIEG (Bitfield-Mask: 0x01)                          */
/* ========================================================  SYOCDCR  ======================================================== */
#define R_SYSTEM_SYOCDCR_DOCDF_Pos                (0UL)          /*!< DOCDF (Bit 0)                                         */
#define R_SYSTEM_SYOCDCR_DOCDF_Msk                (0x1UL)        /*!< DOCDF (Bitfield-Mask: 0x01)                           */
#define R_SYSTEM_SYOCDCR_DBGEN_Pos                (7UL)          /*!< DBGEN (Bit 7)                                         */
#define R_SYSTEM_SYOCDCR_DBGEN_Msk                (0x80UL)       /*!< DBGEN (Bitfield-Mask: 0x01)                           */
/* ========================================================  RSTSR0  ========================================================= */
#define R_SYSTEM_RSTSR0_PORF_Pos                  (0UL)          /*!< PORF (Bit 0)                                          */
#define R_SYSTEM_RSTSR0_PORF_Msk                  (0x1UL)        /*!< PORF (Bitfield-Mask: 0x01)                            */
#define R_SYSTEM_RSTSR0_LVD0RF_Pos                (1UL)          /*!< LVD0RF (Bit 1)                                        */
#define R_SYSTEM_RSTSR0_LVD0RF_Msk                (0x2UL)        /*!< LVD0RF (Bitfield-Mask: 0x01)                          */
#define R_SYSTEM_RSTSR0_LVD1RF_Pos                (2UL)          /*!< LVD1RF (Bit 2)                                        */
#define R_SYSTEM_RSTSR0_LVD1RF_Msk                (0x4UL)        /*!< LVD1RF (Bitfield-Mask: 0x01)                          */
#define R_SYSTEM_RSTSR0_LVD2RF_Pos                (3UL)          /*!< LVD2RF (Bit 3)                                        */
#define R_SYSTEM_RSTSR0_LVD2RF_Msk                (0x8UL)        /*!< LVD2RF (Bitfield-Mask: 0x01)                          */
#define R_SYSTEM_RSTSR0_DPSRSTF_Pos               (7UL)          /*!< DPSRSTF (Bit 7)                                       */
#define R_SYSTEM_RSTSR0_DPSRSTF_Msk               (0x80UL)       /*!< DPSRSTF (Bitfield-Mask: 0x01)                         */
/* ========================================================  RSTSR2  ========================================================= */
#define R_SYSTEM_RSTSR2_CWSF_Pos                  (0UL)          /*!< CWSF (Bit 0)                                          */
#define R_SYSTEM_RSTSR2_CWSF_Msk                  (0x1UL)        /*!< CWSF (Bitfield-Mask: 0x01)                            */
/* =========================================================  MOMCR  ========================================================= */
#define R_SYSTEM_MOMCR_MODRV_Pos                  (4UL)          /*!< MODRV (Bit 4)                                         */
#define R_SYSTEM_MOMCR_MODRV_Msk                  (0x30UL)       /*!< MODRV (Bitfield-Mask: 0x03)                           */
#define R_SYSTEM_MOMCR_MOSEL_Pos                  (6UL)          /*!< MOSEL (Bit 6)                                         */
#define R_SYSTEM_MOMCR_MOSEL_Msk                  (0x40UL)       /*!< MOSEL (Bitfield-Mask: 0x01)                           */
/* ========================================================  FWEPROR  ======================================================== */
#define R_SYSTEM_FWEPROR_FLWE_Pos                 (0UL)          /*!< FLWE (Bit 0)                                          */
#define R_SYSTEM_FWEPROR_FLWE_Msk                 (0x3UL)        /*!< FLWE (Bitfield-Mask: 0x03)                            */
/* =======================================================  LVD1CMPCR  ======================================================= */
#define R_SYSTEM_LVD1CMPCR_LVD1LVL_Pos            (0UL)          /*!< LVD1LVL (Bit 0)                                       */
#define R_SYSTEM_LVD1CMPCR_LVD1LVL_Msk            (0x1fUL)       /*!< LVD1LVL (Bitfield-Mask: 0x1f)                         */
#define R_SYSTEM_LVD1CMPCR_LVD1E_Pos              (7UL)          /*!< LVD1E (Bit 7)                                         */
#define R_SYSTEM_LVD1CMPCR_LVD1E_Msk              (0x80UL)       /*!< LVD1E (Bitfield-Mask: 0x01)                           */
/* =======================================================  LVD2CMPCR  ======================================================= */
#define R_SYSTEM_LVD2CMPCR_LVD2LVL_Pos            (0UL)          /*!< LVD2LVL (Bit 0)                                       */
#define R_SYSTEM_LVD2CMPCR_LVD2LVL_Msk            (0x7UL)        /*!< LVD2LVL (Bitfield-Mask: 0x07)                         */
#define R_SYSTEM_LVD2CMPCR_LVD2E_Pos              (7UL)          /*!< LVD2E (Bit 7)                                         */
#define R_SYSTEM_LVD2CMPCR_LVD2E_Msk              (0x80UL)       /*!< LVD2E (Bitfield-Mask: 0x01)                           */
/* ========================================================  LVD1CR0  ======================================================== */
#define R_SYSTEM_LVD1CR0_RIE_Pos                  (0UL)          /*!< RIE (Bit 0)                                           */
#define R_SYSTEM_LVD1CR0_RIE_Msk                  (0x1UL)        /*!< RIE (Bitfield-Mask: 0x01)                             */
#define R_SYSTEM_LVD1CR0_DFDIS_Pos                (1UL)          /*!< DFDIS (Bit 1)                                         */
#define R_SYSTEM_LVD1CR0_DFDIS_Msk                (0x2UL)        /*!< DFDIS (Bitfield-Mask: 0x01)                           */
#define R_SYSTEM_LVD1CR0_CMPE_Pos                 (2UL)          /*!< CMPE (Bit 2)                                          */
#define R_SYSTEM_LVD1CR0_CMPE_Msk                 (0x4UL)        /*!< CMPE (Bitfield-Mask: 0x01)                            */
#define R_SYSTEM_LVD1CR0_FSAMP_Pos                (4UL)          /*!< FSAMP (Bit 4)                                         */
#define R_SYSTEM_LVD1CR0_FSAMP_Msk                (0x30UL)       /*!< FSAMP (Bitfield-Mask: 0x03)                           */
#define R_SYSTEM_LVD1CR0_RI_Pos                   (6UL)          /*!< RI (Bit 6)                                            */
#define R_SYSTEM_LVD1CR0_RI_Msk                   (0x40UL)       /*!< RI (Bitfield-Mask: 0x01)                              */
#define R_SYSTEM_LVD1CR0_RN_Pos                   (7UL)          /*!< RN (Bit 7)                                            */
#define R_SYSTEM_LVD1CR0_RN_Msk                   (0x80UL)       /*!< RN (Bitfield-Mask: 0x01)                              */
/* ========================================================  LVD2CR0  ======================================================== */
#define R_SYSTEM_LVD2CR0_RIE_Pos                  (0UL)          /*!< RIE (Bit 0)                                           */
#define R_SYSTEM_LVD2CR0_RIE_Msk                  (0x1UL)        /*!< RIE (Bitfield-Mask: 0x01)                             */
#define R_SYSTEM_LVD2CR0_DFDIS_Pos                (1UL)          /*!< DFDIS (Bit 1)                                         */
#define R_SYSTEM_LVD2CR0_DFDIS_Msk                (0x2UL)        /*!< DFDIS (Bitfield-Mask: 0x01)                           */
#define R_SYSTEM_LVD2CR0_CMPE_Pos                 (2UL)          /*!< CMPE (Bit 2)                                          */
#define R_SYSTEM_LVD2CR0_CMPE_Msk                 (0x4UL)        /*!< CMPE (Bitfield-Mask: 0x01)                            */
#define R_SYSTEM_LVD2CR0_FSAMP_Pos                (4UL)          /*!< FSAMP (Bit 4)                                         */
#define R_SYSTEM_LVD2CR0_FSAMP_Msk                (0x30UL)       /*!< FSAMP (Bitfield-Mask: 0x03)                           */
#define R_SYSTEM_LVD2CR0_RI_Pos                   (6UL)          /*!< RI (Bit 6)                                            */
#define R_SYSTEM_LVD2CR0_RI_Msk                   (0x40UL)       /*!< RI (Bitfield-Mask: 0x01)                              */
#define R_SYSTEM_LVD2CR0_RN_Pos                   (7UL)          /*!< RN (Bit 7)                                            */
#define R_SYSTEM_LVD2CR0_RN_Msk                   (0x80UL)       /*!< RN (Bitfield-Mask: 0x01)                              */
/* ========================================================  LOCOCR  ========================================================= */
#define R_SYSTEM_LOCOCR_LCSTP_Pos                 (0UL)          /*!< LCSTP (Bit 0)                                         */
#define R_SYSTEM_LOCOCR_LCSTP_Msk                 (0x1UL)        /*!< LCSTP (Bitfield-Mask: 0x01)                           */
/* =======================================================  LOCOUTCR  ======================================================== */
#define R_SYSTEM_LOCOUTCR_LOCOUTRM_Pos            (0UL)          /*!< LOCOUTRM (Bit 0)                                      */
#define R_SYSTEM_LOCOUTCR_LOCOUTRM_Msk            (0xffUL)       /*!< LOCOUTRM (Bitfield-Mask: 0xff)                        */

/***********************************************************************************************************************
 * Exported global variables
 **********************************************************************************************************************/

/***********************************************************************************************************************
 * Exported global functions (to be accessed by other files)
 **********************************************************************************************************************/

#endif
